app/views/sources/index.html.erb

                <div class="comments">
                  <% source.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."source_id" = $1  [["source_id", 1]]