app/views/users/index.html.erb


<p><%= Following.all.to_a %></p>
---
SELECT "followings".* FROM "followings"