app/helpers/application_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    if session[:user_id]
      User.where(:id => session[:user_id]).first