app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "source_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 45], ["source_id", 17], ["text", "this is a comment"], ["created_at", "2020-10-13 14:31:39.760423"], ["updated_at", "2020-10-13 14:31:39.760423"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.source_id = params[:source_id]
    @comment.user_id = current_user

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]
---
  def destroy
    @comment = Comment.find(params[:comment_id])
    @comment.destroy