app/controllers/followings_controller.rb

INSERT INTO "followings" ("follower_id", "followed_id") VALUES ($1, $2) RETURNING "id"  [["follower_id", 1], ["followed_id", 3]]
---
  def follow
    flash.now[:notice] = 'You now follow'
    @follow = Following.create(following_params)

DELETE FROM "followings" WHERE "followings"."id" = $1  [["id", 4]]
---
  def unfollow
    @following = Following.where(following_params).first
    @following.destroy