app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "user1"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "followings" ON "users"."id" = "followings"."follower_id" WHERE "followings"."followed_id" = $1  [["followed_id", 8]]
SELECT COUNT(*) FROM "users" INNER JOIN "followings" ON "users"."id" = "followings"."followed_id" WHERE "followings"."follower_id" = $1  [["follower_id", 8]]
---
  def try_login
    return unless params[:username].present?

    user_found = User.where(username: params[:username]).first

    if user_found
      photo = user_found.photo.attached? ? url_for(user_found.photo) : 'profile.png'

      session[:user_id] = user_found.id
      session[:username] = user_found.username
      session[:name] = user_found.full_name
      session[:photo] = photo
      session[:followeds] = user_found.followeds.count
      session[:followers] = user_found.followers.count