app/controllers/sources_controller.rb

  def index
    @source = Source.new
    @sources = Source.order('created_at DESC').includes(:author, :comments)
    @users = User.where.not(id: current_user).limit(15)
    @following = User.find(current_user).followeds
---
SELECT "sources".* FROM "sources" ORDER BY created_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    if current_user
      @source = User.find(current_user).sources.new(source_params)
    else
      flash[:notice] = 'you need to be logged in to create posts!'
      redirect_to sources_path
    end

    respond_to do |format|
      if @source.save
---
SELECT "sources".* FROM "sources" WHERE "sources"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sources" ("author_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 3], ["text", "this is my new source"], ["created_at", "2020-10-05 13:30:10.345047"], ["updated_at", "2020-10-05 13:30:10.345047"]]

  def update
    respond_to do |format|
      if @source.update(source_params)
---
UPDATE "sources" SET "text" = $1, "updated_at" = $2 WHERE "sources"."id" = $3  [["text", "J-Live - Braggin Writes (1996)"], ["updated_at", "2020-10-08 11:13:25.927767"], ["id", 13]]

  def destroy
    if @source.destroy
---
DELETE FROM "sources" WHERE "sources"."id" = $1  [["id", 7]]

  def set_source
    @source = Source.find(params[:id])
---
SELECT "sources".* FROM "sources" WHERE "sources"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]