app/controllers/sources_controller.rb

  def index
    @source = Source.new
    @sources = Source.all
    @users = User.limit(3)
---
SELECT "sources".* FROM "sources"
SELECT "users".* FROM "users" LIMIT $1  [["LIMIT", 3]]