app/controllers/users_controller.rb

  def index
    @users = User.all.limit(10)
    @following = User.find(current_user).followeds
---
SELECT "users".* FROM "users" LIMIT $1  [["LIMIT", 10]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @source = Source.new
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save!
---
INSERT INTO "users" ("username", "full_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "u3"], ["full_name", "user three "], ["created_at", "2020-10-02 12:50:28.751356"], ["updated_at", "2020-10-02 12:50:28.751356"]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "full_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["full_name", "another user"], ["updated_at", "2020-10-02 13:18:29.954976"], ["id", 1]]